#include "led.h"	

 /**************************************************************************
功能描述：点亮一个指定的指示灯(DS1 DS2)
入口参数：uint8 led_idx  (可取值LED_1或LED_2)
返回值：无
 *************************************************************************/
void led_on(uint8 led_idx)
{
  switch(led_idx)
	{
		case LED_1:
      LED_B=0;	      //控制P0.6端口输出低电平，点亮蓝色指示灯DS1
		  break;		
		case LED_2:
      LED_R=0;        //控制P0.7端口输出低电平，点亮红色指示灯DS2
		  break;
		default:
		  break;
  }
}

/**************************************************************************
功能描述：熄灭一个指定的指示灯(DS1 DS2)
入口参数：uint8 led_idx  (可取值LED_1或LED_2)
返回值：无
 *************************************************************************/
void led_off(uint8 led_idx)
{
  switch(led_idx)
	{
		case LED_1:
      LED_B=1;	      //控制P0.6端口输出高电平，熄灭蓝色指示灯DS1
		  break;		
		case LED_2:
      LED_R=1;        //控制P0.7端口输出高电平，熄灭红色指示灯DS2
		  break;
		default:
		  break;
  }
}

/**************************************************************************
功能描述：翻转一个指定的指示灯(DS1 DS2)
入口参数：uint8 led_idx  (可取值LED_1或LED_2)
返回值：无
*************************************************************************/
void led_toggle(uint8 led_idx)
{
  switch(led_idx)
	{
		case LED_1:
      LED_B=~LED_B;	      //控制P0.6端口输出不同于上一次的电平，翻转蓝色指示灯DS1
		  break;		
		case LED_2:
      LED_R=~LED_R;       //控制P0.7端口输出不同于上一次的电平，翻转红色指示灯DS2
		  break;
		default:
		  break;
  }
}

/**************************************************************************
功能描述：点亮开发板上的2个指示灯(DS1 DS2)
入口参数：无
返回值：无
 *************************************************************************/
void leds_on(void)
{
		LED_B=0;	      //控制P0.6端口输出低电平，点亮蓝色指示灯DS1
		LED_R=0;        //控制P0.7端口输出低电平，点亮红色指示灯DS2
}

/**************************************************************************
功能描述：熄灭开发板上的2个指示灯(DS1 DS2)
入口参数：无
返回值：无
 *************************************************************************/
void leds_off(void)
{
		LED_B=1;	      //控制P0.6端口输出高电平，熄灭蓝色指示灯DS1
		LED_R=1;        //控制P0.7端口输出高电平，熄灭红色指示灯DS2
}

/*********************************END FILE********************************************/	

